Repository: AquariusBrowser/Blend4Web
Catalog: doc_src/locale/*/LC_MESSAGES/meshes.po
Languages: ru, zh

source: Meshes
ru: Меши
zh: 网格

source: Table of Content
ru: Содержание
zh: 目录

source: Static and Dynamic Objects
ru: Статические и динамические объекты
zh: 静态和动态物体

source: All ``MESH`` objects can be divided into static and dynamic objects.
ru: Все объекты типа ``MESH`` можно разделить на статические и динамические.
zh: 所有``MESH`` 物体可分为静态和动态物体。

source: **Static objects** are objects, the meshes of which can be merged together if they have the same material.
ru: **Статические объекты** - объекты, меши которых могут быть объединены друг с другом, если они имеют одинаковый материал.
zh: **静态物体** 是物体，具有相同的材质的网格可以合并在一起。

source: **Dynamic objects** are objects, the meshes of which cannot be combined with each other.
ru: **Динамические объекты** - объекты, меши которых не могут быть скомбинированы друг с другом.
zh: **动态物体** 是物体，网格不可以互相合并。

source: Merging of static objects - so called batching - is performed automatically when the scene is loaded in order to optimize the number of draw calls. The conversion is performed even if there is just one object in the scene. The center of the resulting mesh is located in the origin.
ru: Объединение статических объектов - т.н. батчинг (batching) - осуществляется автоматически при загрузке сцены в целях оптимизации количества вызовов отрисовки. Конвертация происходит, даже если на сцене присутствует всего один объект. Центр получившегося в результате конвертации меша находится в начале координат.
zh: 讲静态物体合并 - 所谓的批量处理 -会在场景在绘制调用优化的时候会自动的执行。该转换在只有一个物体在场景的时候也会进行。所产生的网格的中心位于原点。

source: The objects which have animation, physics or a parent, which is a dynamic object, are considered dynamic.
ru: Объекты, имеющие анимацию, физику или родителя, являющегося динамическим объектом, рассматриваются как динамические.
zh: 具有动画，物理或父级关系的物体，是一个动态物体，都被认为是动态的。

source: Object movement via API is possible only for dynamic objects. In order to make the movement of the object without dynamic settings possible, it is necessary to activate ``Force Dynamic Object`` option in its settings.
ru: Перемещение посредством API возможно только в случае динамических объектов. Чтобы обеспечить движение объекта, не имеющего настроек динамического объекта, в его настройках следует активировать опцию ``Force Dynamic Object``.
zh: 只有动态物体才能通过API来移动。为了使物体的无动态设置也可以运动，必须激活它的 ``Force Dynamic Object`` 选项。

source: Settings
ru: Настройка
zh: 设置

source: Meshes have all settings of the :ref:`objects <object_settings>` and several additional settings.
ru: Меши обладают всеми параметрами :ref:`объектов <object_settings>`, а также некоторыми дополнительными параметрами.
zh: 网格含有 :ref:`物体 <object_settings>` 所有的设置和一些额外的设置。

source: This section is used to override bounding volumes. Such volumes are used to check object’s visibility, to handle collisions and physics interaction. By editing them, you can achieve various effects.
ru: Эта вкладка используется для настройки ограничивающих объёмов. Такие объёмы используются при определении видимости объекта, для рассчёта столкновений и физических взаимодействий. Манипулируя ими, можно добиться различных эффектов.
zh: 这部分是用来覆盖包围盒。这样体积盒用于检查物体的可见性，来处理碰撞和物理交互。通过编辑它们，可以实现各种效果。

source: The ``Override Bounding Volumes`` section can be found on the ``Blend4Web`` panel (beside the :ref:`normals editor <normals_editor>`.).
ru: Раздел ``Override Bounding Volumes`` расположен на панели иструментов ``Blend4Web`` (рядом с :ref:`редактором нормалей <normals_editor>`).
zh: 该 ``覆盖包围体积`` 部分可以在 ``Blend4Web`` 面板上找到（在 :ref:`法线编辑器 <normals_editor>` 旁边）。

source: Show the bounding volumes in the Blender viewport. This option works only if the ``Override Mesh Boundings`` parameter is enabled. The volume can be rendered as a rectangular cuboid or as a combination of circles or ellipses. More than one method of rendering can be active at the same time (even all three methods can be enabled simultaneously).
ru: Отобразить ограничивающий объём во вьюпорте Blender. Работает только если активирована опция ``Override Mesh Boundings``. Объём может быть представлен в виде параллелепипеда либо в виде комбинации окружностей или эллипсов. Одновременно может работать более одного метода визуализации (в том числе все три).
zh: 显示在Blender视口中的包围盒。只有当 ``覆盖网格包围`` 参数开启，启用该选项。包围盒可以呈现为长方体或为圆形或椭圆的组合。多个渲染方式可以在同一时间是启用（甚至所有三种方法可以同时启用）。

source: The selected rendering method does not affect the bounding volume shape, only the way it is represented in the viewport.
ru: Метод визуализации не влияет на форму ограничивающего объёма, только на его представление во вьюпорте.
zh: 所选渲染方法不会影响包围盒的形状，只是影响它在视口中展示的方式。

source: This button enables the override of the basic mesh boundings. The bounding volume always has the shape of a rectangular cuboid with a center in the object’s pivot point.
ru: Эта кнопка включает использование нестандартного ограничивающего объёма. Ограничивающий объём имеет форму параллелпипеда, центр которого совпадает с точкой привязки объекта.
zh: 此按钮可以使基本网格包围覆盖。包围盒总是一个长方体并以物体的枢轴点为中心。

source: *MinX and MaxX*
ru: *MinX и MaxX*

source: The volume’s X dimensions. By default, *MinX* = -1, *MaxX* = 1
ru: Размеры ограничивающего объёма по оси Z. По умолчанию *MinZ* = -1, *MaxZ* = 1.
zh: 包围盒的X尺寸。默认情况下， *MinX* = -1, *MaxX* = 1

source: *MinY and MaxY*
ru: *MinY и MaxY*

source: The volume’s Y dimensions. By default, *MinY* = -1, *MaxY* = 1.
ru: Размеры ограничивающего объёма по оси Y. По умолчанию *MinY* = -1, *MaxY* = 1.
zh: 包围盒的Y尺寸。缺省情况下，*MinY* = -1, *MaxY* = 1.

source: *MinZ and MaxZ*
ru: *MinZ и MaxZ*

source: The volume’s Z dimensions. By default, *MinZ* = -1, *MaxZ* = 1
ru: Размеры ограничивающего объёма по оси Z. По умолчанию *MinZ* = -1, *MaxZ* = 1.
zh: 包围盒的z方向。缺省情况下，*MinZ* = -1, *MaxZ* = 1

source: Copying Objects (Instancing)
ru: Копирование объектов (инстансинг)
zh: 复制物体（实例化）

source: It is often required to copy (to make instances of) objects during application work.
ru: Часто возникает необходимость копирования объектов (инстансинг) во время работы приложения.
zh: 在应用程序工作中经常需要复制（使实例）物体。

source: Copying objects has its limitations:
ru: Существует ряд ограничений на копируемые объекты:
zh: 复制物体有其局限性：

source: only ``MESH`` objects can be copied
ru: тип объекта должен быть ``MESH``
zh: 只有 ``MESH`` 物体可以被复制

source: the object should be :ref:`dynamic <static_dynamic_objects>` (enable ``Rendering Properties > Force Dynamic Object``)
ru: объект должен быть :ref:`динамическим <static_dynamic_objects>` (включить настройку ``Rendering Properties > Force Dynamic Object``)
zh: 物体应该是 :ref:`动态 <static_dynamic_objects>` （启用 ``渲染属性>强制动态物体``）

source: the source object should belong to the active scene
ru: объект должен принадлежать активной сцене
zh: 源物体应该属于主控场景

source: Making a Simple Copy
ru: Простое копирование
zh: 制作一个简单的复制

source: In case of simple copying the new object will share the mesh with the original object. Thus, if the original object’s mesh is changed, the copied object’s mesh will be changed too. To make simple copying possible, it’s enough to turn on the ``Blend4Web > Force Dynamic Object`` setting in the source object’s properties.
ru: В случае простого копирования для объекта-копии будет использоваться геометрия объекта, с которого осуществлялось копирование. При изменении геометрии на исходном объекте, геометрия изменится и на объекте-копии.
zh: 在简单复制的情况下，新的物体将与原始物体共享网格。因此，如果原始物体的网格被改变，则复制的物体的网格也将被改变。为了让简单复制可行，只需要打开源物体属性设置的 ``Blend4Web>强制动态物体``。

source: Making a Deep Copy
ru: Глубокое копирование
zh: 制作深复制

source: In case of deep copying, the new object will have unique properties, namely it will have its own mesh. Thus, if the original object’s mesh is changed, the copied object’s mesh will not be changed. Also, the canvas textures on the copied objects are different textures and not one and the same like it is the case with the simple copying. To make deep copying possible, it is required to enable the :ref:`Rendering Properties > Dynamic Geometry <dynamic_geom>` checkbox for the source object. |
ru: При глубоком копировании новый объект будет обладать уникальными для него свойствами, а именно, он будет иметь свою собственную геометрию. То есть при изменении геометрии на объекте-оригинале у объекта-копии геометрия изменяться не будет. Также при глубоком копировании canvas-текстуры на копиях - именно разные текстуры, в то время как при простом копировании - одна и та же. Для такого типа копирования на исходном объекте нужно дополнительно выставить опцию :ref:`Rendering Properties > Dynamic Geometry <dynamic_geom>`.
zh: 在深度复制的情况下，新物体将具有自己的属性，即它会有自己的网格。因此，就算原始物体的网格被改变，复制的物体的网格也不被改变。同样，与简单复制的情况不一样的是深度复制物体的画布纹理是和原始物体的纹理不是一个。为了使用深度复制，启用源物体的 :ref:`选人属性 > 动态几何体 <dynamic_geom>` 复选框。 |

source: Copying objects in runtime can be performed with the ``copy`` method of the ``objects.js`` module. This method requires three arguments: the id of the source object, a unique name for the new object and the boolean value to specify the copy mode (i.e. simple or deep). By default, simple copying will be performed.
ru: Для копирования объектов в модуле ``objects.js`` предусмотрена функция ``copy``, в которую надо передать идентификатор копируемого объекта, уникальное имя нового объекта и булеву переменную, определяющую тип копирования: ``true``- глубокое, ``false`` - простое. По умолчанию будет осуществлено простое копирование.
zh: 在运行状态复制物体可以使用 ``objects.js`` 模块的 ``copy`` 方法。此方法需要三个参数：源物体的id，新物体一个唯一的名称和指定复印模式（即简单或深）的布尔值。默认简单复制将被执行。

source: The newly created object should be added to the scene. This can be performed with the ``append_object`` method of the ``scenes.js`` module. The new object should be passed to it as an argument.
ru: Созданный при копировании объект необходимо добавить на сцену. Для этого в модуле ``scenes.js`` существует функция ``append_object``, куда нужно передать объект, полученный копированием.
zh: 新创建的物体需要添加到场景。可以用 ``scenes.js`` 模块的 ``append_object`` 方法。新物体应该被作为参数传递给它。

source: Removing Objects
ru: Удаление объектов
zh: 删除物体

source: To remove objects, use the ``remove_object`` method of the ``scenes.js`` module. Pass the object to it as an argument. Dynamic mesh- and empty-type objects can be removed this way.
ru: Для удаления объектов, в модуле ``scenes.js`` предусмотрена функция ``remove_object``, куда надо передать объект. Возможно удаление динамических mesh- и empty-объектов.
zh: 要删除物体，请使用 ``scenes.js`` 模块的 ``remove_object`` 方法。传递物体作为参数。动态网格和空类型的物体可以用这种方式删除。

source: Object Selection
ru: Выделение объектов
zh: 物体选择

source: In order to enable selection of a certain object, it is required to enable the ``Selectable`` checkbox on the ``Selection and Outlining`` panel.
ru: Чтобы разрешить выделение конкретного объекта, необходимо установить флаг ``Selectable`` в панели ``Selection and Outlining``.
zh: 为了使一个特定的物体的选择启用，需要开启 ``选择与轮廓线`` 面板上的 ``可选择`` 复选框。

source: Make sure that the status on the ``Scene > Object Outlining`` panel is set to ``ON`` or ``AUTO``.
ru: Следует убедится в том, что в панели ``Scene > Object Outlining`` установлено состояние ``ON`` или ``AUTO``.
zh: 确保 ``场景状态>物体轮廓`` 面板被设置为 ``ON`` 或 ``AUTO`` 。

source: Object selection is possible programmatically via API, for example, in the ``scenes.js`` module there is the ``pick_object`` function which selects an object based on canvas 2D coordinates,
ru: Выделение объекта возможно программно через API, например, в модуле ``scenes.js`` имеется функция ``pick_object``, которая по координатам в canvas'е выделяет объект,
zh: 物体选择也可以通过API编程方式实现，例如，在 ``scenes.js`` 模块有基于二维画布坐标进行选择物体的 ``pick_object`` 函数，

source: or using the :ref:`NLA Script <nla_select_play>`.
ru: или с использованием :ref:`NLA-скрипта <nla_select_play>`.
zh: 或使用 :ref:`NLA 脚本 <nla_select_play>`.

source: If the selectable object has enabled ``Enable Outlining`` and ``Outline on Select`` checkboxes on the ``Object > Selection`` and Outlining panel, then the ``pick_object`` function call will activate :ref:`outline glow animation <outline>`.
ru: Если для выделяемого объекта в панели ``Object > Selection and Outlining`` установлены флаги ``Enable Outlining`` и ``Outline on Select``, то вызов функции ``pick_object`` приведет к активации :ref:`Outline-анимации <outline>`.
zh: 如果选择的物体已启用了 ``启用外轮廓`` 和 ``物体 > 选择`` 和 大纲面板上的 ``轮廓选择`` 复选框，那么 ``pick_object`` 函数调用将激活 :ref:`外轮廓辉光动画 <outline>`.

source: If the selected object is transparent (``Blend``, ``Add`` and ``Sort`` transparency types), outline glow will only be visible on the parts that have ``Alpha`` value higher than 0.5.
ru: Если выделяемый объект полупрозрачен (имеет тип прозрачности ``Blend`` ``Add`` или ``Sort``), outline-анимация будет видна только на тех частях объекта, для которых значение прозрачности ``Alpha`` выше 0.5.

source: Morphing
ru: Морфинг
zh: 变形

source: Morph targets can be added using Blender’s standard ``Mesh > Shape keys`` interface.
ru: Для создания ключей деформации (опорных фигур) перейдите во вкладку ``Mesh > Shape keys``.
zh: 变形目标可以用Blender的标准 ``网格 > 形变键`` 界面进行添加。

source: The engine supports all shape key options under the “Relative” type.
ru: Движком поддерживаются все опции типа "Relative" для ключей деформации.
zh: 该引擎支持所有 “相对” 类型下的形变键选项。

source: To set a shape key value, use the ``apply_shape_key`` method of the ``geometry.js`` module.
ru: Для изменения значения ключа деформации, существует функция ``apply_shape_key`` в модуле ``geometry.js``.
zh: 要设置一个形变键值，使用 ``geometry.js`` 模块的 ``apply_shape_key`` 方法。

source: The object must have ``Export Shape Keys`` parameter enabled.
ru: На объекте должно стоять свойство *Export Shape Keys*.
zh: 该物体必须具有 ``导出形变键`` 参数启用。

source: Override Bounding Volumes
zh: 覆盖包围体积

source: *Show Boundings*
zh: *显示包围*

source: *Override Mesh Boundings*
zh: *覆盖网格包围*
